/** @file

;******************************************************************************
;* Copyright (c) 2021, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

/=#

#include "Standard.uni"

#string STR_NONE_STRING  #language en-US  "None"
//
// Memory Type
//
#string STR_MEMORY_TYPE_OTHER_STRING                        #language en-US  "Other"
#string STR_MEMORY_TYPE_UNKNOWN_STRING                      #language en-US  "Unknown"
#string STR_MEMORY_TYPE_DRAM_STRING                         #language en-US  "DRAM"
#string STR_MEMORY_TYPE_EDRAM_STRING                        #language en-US  "EDRAM"
#string STR_MEMORY_TYPE_VRAM_STRING                         #language en-US  "VRAM"
#string STR_MEMORY_TYPE_SRAM_STRING                         #language en-US  "SRAM"
#string STR_MEMORY_TYPE_RAM_STRING                          #language en-US  "RAM"
#string STR_MEMORY_TYPE_ROM_STRING                          #language en-US  "ROM"
#string STR_MEMORY_TYPE_FLASH_STRING                        #language en-US  "FLASH"
#string STR_MEMORY_TYPE_EEPROM_STRING                       #language en-US  "EEPROM"
#string STR_MEMORY_TYPE_FEPROM_STRING                       #language en-US  "FEPROM"
#string STR_MEMORY_TYPE_EPROM_STRING                        #language en-US  "EPROM"
#string STR_MEMORY_TYPE_CDRAM_STRING                        #language en-US  "CDRAM"
#string STR_MEMORY_TYPE_3DRAM_STRING                        #language en-US  "3DRAM"
#string STR_MEMORY_TYPE_SDRAM_STRING                        #language en-US  "SDRAM"
#string STR_MEMORY_TYPE_SGRAM_STRING                        #language en-US  "SGRAM"
#string STR_MEMORY_TYPE_RDRAM_STRING                        #language en-US  "RDRAM"
#string STR_MEMORY_TYPE_DDR_STRING                          #language en-US  "DDR"
#string STR_MEMORY_TYPE_DDR2_STRING                         #language en-US  "DDR2"
#string STR_MEMORY_TYPE_DDR2_FB_DIMM_STRING                 #language en-US  "DDR2 FB-DIMM"
#string STR_MEMORY_TYPE_DDR3_STRING                         #language en-US  "DDR3"
#string STR_MEMORY_TYPE_FBD2_STRING                         #language en-US  "FBD2"
#string STR_MEMORY_TYPE_DDR4_STRING                         #language en-US  "DDR4"
#string STR_MEMORY_TYPE_LPDDR_STRING                        #language en-US  "LPDDR"
#string STR_MEMORY_TYPE_LPDDR2_STRING                       #language en-US  "LPDDR2"
#string STR_MEMORY_TYPE_LPDDR3_STRING                       #language en-US  "LPDDR3"
#string STR_MEMORY_TYPE_LPDDR4_STRING                       #language en-US  "LPDDR4"
#string STR_MEMORY_TYPE_LOGICAL_NON_VOLATILE_DEVICE_STRING  #language en-US  "Logical non-volatile device"
#string STR_MEMORY_TYPE_HBM_STRING                          #language en-US  "HBM (High Bandwidth Memory)"
#string STR_MEMORY_TYPE_HBM2_STRING                         #language en-US  "HBM2 (High Bandwidth Memory Generation 2)"
#string STR_MEMORY_TYPE_DDR5_STRING                         #language en-US  "DDR5"
#string STR_MEMORY_TYPE_LPDDR5_STRING                       #language en-US  "LPDDR5"

//
// Memory Type Detail
//
#string STR_MEMORY_TYPE_DETAIL_RESERVED_STRING              #language en-US  "Reserved"
#string STR_MEMORY_TYPE_DETAIL_OTHER_STRING                 #language en-US  "Other"
#string STR_MEMORY_TYPE_DETAIL_UNKNOWN_STRING               #language en-US  "Unknown"
#string STR_MEMORY_TYPE_DETAIL_FAST_PAGED_STRING            #language en-US  "Fast-paged"
#string STR_MEMORY_TYPE_DETAIL_STATIC_COLUMN_STRING         #language en-US  "Static column"
#string STR_MEMORY_TYPE_DETAIL_PSEUDO_STATIC_STRING         #language en-US  "Pseudo-static"
#string STR_MEMORY_TYPE_DETAIL_RAMBUS_STRING                #language en-US  "RAMBUS"
#string STR_MEMORY_TYPE_DETAIL_SYNCHRONOUS_STRING           #language en-US  "Synchronous"
#string STR_MEMORY_TYPE_DETAIL_CMOS_STRING                  #language en-US  "CMOS"
#string STR_MEMORY_TYPE_DETAIL_EDO_STRING                   #language en-US  "EDO"
#string STR_MEMORY_TYPE_DETAIL_WINDOW_DRAM_STRING           #language en-US  "Window DRAM"
#string STR_MEMORY_TYPE_DETAIL_CACHE_DRAM_STRING            #language en-US  "Cache DRAM"
#string STR_MEMORY_TYPE_DETAIL_NON_VOLATILE_STRING          #language en-US  "Non-volatile"
#string STR_MEMORY_TYPE_DETAIL_BUFFERED_STRING              #language en-US  "Registered (Buffered)"
#string STR_MEMORY_TYPE_DETAIL_UNBUFFERED_STRING            #language en-US  "Unbuffered (Unregistered)"
#string STR_MEMORY_TYPE_DETAIL_LRDIMM_STRING                #language en-US  "LRDIMM"

//
// Dram Type
//
#string STR_DRAM_TYPE_HYBRID_DIMM_STRING                    #language en-US  "Hybrid DIMM"
#string STR_DRAM_TYPE_RDIMM_STRING                          #language en-US  "RDIMM"
#string STR_DRAM_TYPE_UDIMM_STRING                          #language en-US  "UDIMM"
#string STR_DRAM_TYPE_LRDIMM_STRING                         #language en-US  "LRDIMM"

//
// ECC Type
//
#string STR_ECC_TYPE_OTHER_STRING                           #language en-US  "Other"
#string STR_ECC_TYPE_UNKNOWN_STRING                         #language en-US  "Unknown"
#string STR_ECC_TYPE_NONE_STRING                            #language en-US  "None"
#string STR_ECC_TYPE_PARITY_STRING                          #language en-US  "Parity"
#string STR_ECC_TYPE_SINGLE_BIT_ECC_STRING                  #language en-US  "Single-bit ECC"
#string STR_ECC_TYPE_MULTI_BIT_ECC_STRING                   #language en-US  "Multi-bit ECC"
#string STR_ECC_TYPE_CRC_STRING                             #language en-US  "CRC"
